## Fase 1: Exploración y limpieza de datos

### 1.Cargar las librerías necesarias y datasets

In [300]:
import pandas as pd #para manejar dataframes
import numpy as np #para operaciones numéricas
import matplotlib.pyplot as plt #para visualización
import seaborn as sns #para visualización avanzada

# Cargar datasets
flight_path = "data/Customer Flight Activity.csv"
loyalty_path = "data/Customer Loyalty History.csv"

df_flights = pd.read_csv(flight_path)
df_loyalty = pd.read_csv(loyalty_path)
print("Datasets cargados exitosamente.")

Datasets cargados exitosamente.

## 2. Exploración inicial de los datos: estructura y tipos

In [301]:
df_flights.head()

,Loyalty Number,Year,Month,Flights Booked,Flights with Companions,Total Flights,Distance,Points Accumulated,Points Redeemed,Dollar Cost Points Redeemed
0,100018,2017,1,3,0,3,1521,152.0,0,0
1,100102,2017,1,10,4,14,2030,203.0,0,0
2,100140,2017,1,6,0,6,1200,120.0,0,0
3,100214,2017,1,0,0,0,0,0.0,0,0
4,100272,2017,1,0,0,0,0,0.0,0,0

In [302]:
df_flights.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 405624 entries, 0 to 405623
Data columns (total 10 columns):
 #   Column                       Non-Null Count   Dtype
---  ------                       --------------   -----
 0   Loyalty Number               405624 non-null  int64
 1   Year                         405624 non-null  int64
 2   Month                        405624 non-null  int64
 3   Flights Booked               405624 non-null  int64
 4   Flights with Companions      405624 non-null  int64
 5   Total Flights                405624 non-null  int64
 6   Distance                     405624 non-null  int64
 7   Points Accumulated           405624 non-null  float64
 8   Points Redeemed              405624 non-null  int64
 9   Dollar Cost Points Redeemed  405624 non-null  int64
dtypes: float64(1), int64(9)
memory usage: 30.9 MB

In [303]:
df_flights.describe().round(2)

,Loyalty Number,Year,Month,Flights Booked,Flights with Companions,Total Flights,Distance,Points Accumulated,Points Redeemed,Dollar Cost Points Redeemed
count,405624.00,405624.0,405624.00,405624.00,405624.00,405624.00,405624.00,405624.00,405624.00,405624.00
mean,550037.87,2017.5,6.50,4.12,1.03,5.15,1208.88,123.69,30.70,2.48
std,258935.29,0.5,3.45,5.23,2.08,6.52,1433.16,146.60,125.49,10.15
min,100018.00,2017.0,1.00,0.00,0.00,0.00,0.00,0.00,0.00,0.00
25%,326961.00,2017.0,3.75,0.00,0.00,0.00,0.00,0.00,0.00,0.00
50%,550834.00,2017.5,6.50,1.00,0.00,1.00,488.00,50.00,0.00,0.00
75%,772194.00,2018.0,9.25,8.00,1.00,10.00,2336.00,239.00,0.00,0.00
max,999986.00,2018.0,12.00,21.00,11.00,32.00,6293.00,676.50,876.00,71.00

In [304]:
df_loyalty.head()

,Loyalty Number,Country,Province,City,Postal Code,Gender,Education,Salary,Marital Status,Loyalty Card,CLV,Enrollment Type,Enrollment Year,Enrollment Month,Cancellation Year,Cancellation Month
0,480934,Canada,Ontario,Toronto,M2Z 4K1,Female,Bachelor,83236.0,Married,Star,3839.14,Standard,2016,2,NaN,NaN
1,549612,Canada,Alberta,Edmonton,T3G 6Y6,Male,College,NaN,Divorced,Star,3839.61,Standard,2016,3,NaN,NaN
2,429460,Canada,British Columbia,Vancouver,V6E 3D9,Male,College,NaN,Single,Star,3839.75,Standard,2014,7,2018.0,1.0
3,608370,Canada,Ontario,Toronto,P1W 1K4,Male,College,NaN,Single,Star,3839.75,Standard,2013,2,NaN,NaN
4,530508,Canada,Quebec,Hull,J8Y 3Z5,Male,Bachelor,103495.0,Married,Star,3842.79,Standard,2014,10,NaN,NaN

In [305]:
df_loyalty.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 16737 entries, 0 to 16736
Data columns (total 16 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Loyalty Number      16737 non-null  int64
 1   Country             16737 non-null  object
 2   Province            16737 non-null  object
 3   City                16737 non-null  object
 4   Postal Code         16737 non-null  object
 5   Gender              16737 non-null  object
 6   Education           16737 non-null  object
 7   Salary              12499 non-null  float64
 8   Marital Status      16737 non-null  object
 9   Loyalty Card        16737 non-null  object
 10  CLV                 16737 non-null  float64
 11  Enrollment Type     16737 non-null  object
 12  Enrollment Year     16737 non-null  int64
 13  Enrollment Month    16737 non-null  int64
 14  Cancellation Year   2067 non-null   float64
 15  Cancellation Month  2067 non-null   float64
dtypes: float64(4), int64(3), object(9)
memory usage: 2.0+ MB

In [306]:
df_loyalty.describe().round(2)

,Loyalty Number,Salary,CLV,Enrollment Year,Enrollment Month,Cancellation Year,Cancellation Month
count,16737.00,12499.00,16737.00,16737.00,16737.00,2067.00,2067.00
mean,549735.88,79245.61,7988.90,2015.25,6.67,2016.50,6.96
std,258912.13,35008.30,6860.98,1.98,3.40,1.38,3.46
min,100018.00,-58486.00,1898.01,2012.00,1.00,2013.00,1.00
25%,326603.00,59246.50,3980.84,2014.00,4.00,2016.00,4.00
50%,550434.00,73455.00,5780.18,2015.00,7.00,2017.00,7.00
75%,772019.00,88517.50,8940.58,2017.00,10.00,2018.00,10.00
max,999986.00,407228.00,83325.38,2018.00,12.00,2018.00,12.00

## 3. Búsqueda de nulos y valores atípicos

In [307]:
df_flights.isna().sum()
df_loyalty.isna().sum()

Loyalty Number            0
Country                   0
Province                  0
City                      0
Postal Code               0
Gender                    0
Education                 0
Salary                 4238
Marital Status            0
Loyalty Card              0
CLV                       0
Enrollment Type           0
Enrollment Year           0
Enrollment Month          0
Cancellation Year     14670
Cancellation Month    14670
dtype: int64

In [308]:
df_flights.isna().mean() * 100
df_loyalty.isna().mean() * 100
#Con porcentajes

Loyalty Number         0.000000
Country                0.000000
Province               0.000000
City                   0.000000
Postal Code            0.000000
Gender                 0.000000
Education              0.000000
Salary                25.321145
Marital Status         0.000000
Loyalty Card           0.000000
CLV                    0.000000
Enrollment Type        0.000000
Enrollment Year        0.000000
Enrollment Month       0.000000
Cancellation Year     87.650117
Cancellation Month    87.650117
dtype: float64

In [309]:
df["Salary"].isna().sum()
df["Salary"].isna().mean()

np.float64(0.0)

## 4. Chequear duplicados

In [310]:
df_flights.duplicated().sum()
df_loyalty.duplicated().sum()

np.int64(0)

## 5. Unir los datasets

In [311]:
df = pd.merge(
    df_flights,
    df_loyalty,
    on="Loyalty Number",
    how="left"
)
print("Datasets unidos exitosamente.")
df.head()

Datasets unidos exitosamente.

,Loyalty Number,Year,Month,Flights Booked,Flights with Companions,Total Flights,Distance,Points Accumulated,Points Redeemed,Dollar Cost Points Redeemed,...,Education,Salary,Marital Status,Loyalty Card,CLV,Enrollment Type,Enrollment Year,Enrollment Month,Cancellation Year,Cancellation Month
0,100018,2017,1,3,0,3,1521,152.0,0,0,...,Bachelor,92552.0,Married,Aurora,7919.20,Standard,2016,8,NaN,NaN
1,100102,2017,1,10,4,14,2030,203.0,0,0,...,College,NaN,Single,Nova,2887.74,Standard,2013,3,NaN,NaN
2,100140,2017,1,6,0,6,1200,120.0,0,0,...,College,NaN,Divorced,Nova,2838.07,Standard,2016,7,NaN,NaN
3,100214,2017,1,0,0,0,0,0.0,0,0,...,Bachelor,63253.0,Married,Star,4170.57,Standard,2015,8,NaN,NaN
4,100272,2017,1,0,0,0,0,0.0,0,0,...,Bachelor,91163.0,Divorced,Star,6622.05,Standard,2014,1,NaN,NaN

In [312]:
# un left para mantener todas las observaciones de actividad de vuelo y añadirle la información de perfil del cliente

In [313]:
#comprobar los nulos una vez unidos, siguen siendo los mismos
df.info()
df.isna().sum()
df.isna().mean() * 100

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 405624 entries, 0 to 405623
Data columns (total 25 columns):
 #   Column                       Non-Null Count   Dtype
---  ------                       --------------   -----
 0   Loyalty Number               405624 non-null  int64
 1   Year                         405624 non-null  int64
 2   Month                        405624 non-null  int64
 3   Flights Booked               405624 non-null  int64
 4   Flights with Companions      405624 non-null  int64
 5   Total Flights                405624 non-null  int64
 6   Distance                     405624 non-null  int64
 7   Points Accumulated           405624 non-null  float64
 8   Points Redeemed              405624 non-null  int64
 9   Dollar Cost Points Redeemed  405624 non-null  int64
 10  Country                      405624 non-null  object
 11  Province                     405624 non-null  object
 12  City                         405624 non-null  object
 13  Postal Code                  405624 non-null  object
 14  Gender                       405624 non-null  object
 15  Education                    405624 non-null  object
 16  Salary                       302952 non-null  float64
 17  Marital Status               405624 non-null  object
 18  Loyalty Card                 405624 non-null  object
 19  CLV                          405624 non-null  float64
 20  Enrollment Type              405624 non-null  object
 21  Enrollment Year              405624 non-null  int64
 22  Enrollment Month             405624 non-null  int64
 23  Cancellation Year            50064 non-null   float64
 24  Cancellation Month           50064 non-null   float64
dtypes: float64(5), int64(11), object(9)
memory usage: 77.4+ MB

Loyalty Number                  0.000000
Year                            0.000000
Month                           0.000000
Flights Booked                  0.000000
Flights with Companions         0.000000
Total Flights                   0.000000
Distance                        0.000000
Points Accumulated              0.000000
Points Redeemed                 0.000000
Dollar Cost Points Redeemed     0.000000
Country                         0.000000
Province                        0.000000
City                            0.000000
Postal Code                     0.000000
Gender                          0.000000
Education                       0.000000
Salary                         25.312112
Marital Status                  0.000000
Loyalty Card                    0.000000
CLV                             0.000000
Enrollment Type                 0.000000
Enrollment Year                 0.000000
Enrollment Month                0.000000
Cancellation Year              87.657535
Cancellation Month             87.657535
dtype: float64

## 6. Ajuste de datos

### 1. Eliminación o imputación de nulos

In [314]:
#Hay un 25% de nulos en la columna Salary
df_loyalty.groupby("Education")["Salary"].describe().round(2)
# salario muy relacionado con nivel educativo

,count,mean,std,min,25%,50%,75%,max
Education,,,,,,,,
Bachelor,10475.0,72451.06,17207.35,-58486.0,58711.00,71960.0,85808.0,105563.0
College,0.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Doctor,734.0,178608.90,70466.19,48109.0,124768.00,182143.5,236612.0,407228.0
High School or Below,782.0,61071.72,12733.50,-49830.0,52151.25,61915.0,71384.5,93875.0
Master,508.0,103757.85,17527.94,56414.0,88120.00,105487.0,118530.0,133080.0

In [315]:
# Trabajamos en el dataframe ya unido 'df'
df["Salary"] = df["Salary"].astype("float")

# Calcular medias por nivel educativo
salary_means = df.groupby("Education")["Salary"].transform("mean")

# Rellenar solo los nulos con la media de su grupo de Education
df["Salary"] = df["Salary"].fillna(salary_means)

In [316]:
# Recalcula la media por Education
edu_means = df.groupby("Education")["Salary"].mean().round(2)
print(edu_means)

# Comprueba en algunas filas concretas
df[df["Education"] == "Bachelor"][["Education", "Salary"]].head(10)

Education
Bachelor                 72476.21
College                       NaN
Doctor                  178335.44
High School or Below     60986.54
Master                  103767.49
Name: Salary, dtype: float64

   Education   Salary
0   Bachelor  92552.0
3   Bachelor  63253.0
4   Bachelor  91163.0
5   Bachelor  70323.0
6   Bachelor  76849.0
7   Bachelor  69695.0
8   Bachelor  63478.0
9   Bachelor  75638.0
10  Bachelor  54133.0
11  Bachelor  89340.0

In [317]:
df["Salary"].isna().sum()
df["Salary"].describe()
df.groupby("Education")["Salary"].mean()

Education
Bachelor                 72476.211860
College                           NaN
Doctor                  178335.439516
High School or Below     60986.544192
Master                  103767.494163
Name: Salary, dtype: float64

In [318]:
# Media global de Salary
global_mean = df["Salary"].mean()

# Rellenar solo los que siguen a NaN
df.loc[df["Salary"].isna(), "Salary"] = global_mean

In [319]:
df["Salary"].isna().sum()
df.groupby("Education")["Salary"].mean()

Education
Bachelor                 72476.211860
College                  79268.825953
Doctor                  178335.439516
High School or Below     60986.544192
Master                  103767.494163
Name: Salary, dtype: float64

In [320]:
df.info() #compruebo que ya no estan los nulos

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 405624 entries, 0 to 405623
Data columns (total 25 columns):
 #   Column                       Non-Null Count   Dtype
---  ------                       --------------   -----
 0   Loyalty Number               405624 non-null  int64
 1   Year                         405624 non-null  int64
 2   Month                        405624 non-null  int64
 3   Flights Booked               405624 non-null  int64
 4   Flights with Companions      405624 non-null  int64
 5   Total Flights                405624 non-null  int64
 6   Distance                     405624 non-null  int64
 7   Points Accumulated           405624 non-null  float64
 8   Points Redeemed              405624 non-null  int64
 9   Dollar Cost Points Redeemed  405624 non-null  int64
 10  Country                      405624 non-null  object
 11  Province                     405624 non-null  object
 12  City                         405624 non-null  object
 13  Postal Code                  405624 non-null  object
 14  Gender                       405624 non-null  object
 15  Education                    405624 non-null  object
 16  Salary                       405624 non-null  float64
 17  Marital Status               405624 non-null  object
 18  Loyalty Card                 405624 non-null  object
 19  CLV                          405624 non-null  float64
 20  Enrollment Type              405624 non-null  object
 21  Enrollment Year              405624 non-null  int64
 22  Enrollment Month             405624 non-null  int64
 23  Cancellation Year            50064 non-null   float64
 24  Cancellation Month           50064 non-null   float64
dtypes: float64(5), int64(11), object(9)
memory usage: 77.4+ MB

In [321]:
#no borro los nulos que no son relevantes o que son lógicos en mi dataset

In [322]:
# A. Convertir columnas temporales a enteros
df["Year"] = df["Year"].astype("int64")
df["Month"] = df["Month"].astype("int64")

In [323]:
# B. Crear columna de fecha completa
df["Date"] = pd.to_datetime(
    df["Year"].astype(str) + "-" + df["Month"].astype(str) + "-01"
)

In [324]:
# C. Columnas categóricas a tipo 'category' 
cat_cols = ["gender", "education", "marital status", "loyalty card", 
            "country", "province", "city"]
for col in cat_cols:
    if col in df.columns:
        df[col] = df[col].astype("category")

In [325]:
# D. CORREGIR SALARIOS NEGATIVOS
df["Salary"] = df["Salary"].abs()  # Valor absoluto, en lugar de eliminar filas

In [326]:
# Estandarizar nombres de columnas (minúsculas)
df_flights.columns = df_flights.columns.str.lower()
df_loyalty.columns = df_loyalty.columns.str.lower()

# Verificar
print("Columnas flights:", df_flights.columns.tolist())
print("Columnas loyalty:", df_loyalty.columns.tolist())

Columnas flights: ['loyalty number', 'year', 'month', 'flights booked', 'flights with companions', 'total flights', 'distance', 'points accumulated', 'points redeemed', 'dollar cost points redeemed']
Columnas loyalty: ['loyalty number', 'country', 'province', 'city', 'postal code', 'gender', 'education', 'salary', 'marital status', 'loyalty card', 'clv', 'enrollment type', 'enrollment year', 'enrollment month', 'cancellation year', 'cancellation month']

In [327]:
df.columns = df.columns.str.lower()
# Verificar
print("Columnas df:", df.columns.tolist())

Columnas df: ['loyalty number', 'year', 'month', 'flights booked', 'flights with companions', 'total flights', 'distance', 'points accumulated', 'points redeemed', 'dollar cost points redeemed', 'country', 'province', 'city', 'postal code', 'gender', 'education', 'salary', 'marital status', 'loyalty card', 'clv', 'enrollment type', 'enrollment year', 'enrollment month', 'cancellation year', 'cancellation month', 'date']

In [328]:
# Verificar que todo está bien
print("Tipos de datos finales:")
print(df.dtypes)
print("\nSalary después de corrección:")
print(df["salary"].describe())
print("\nNulos restantes en Salary:", df["salary"].isna().sum())

Tipos de datos finales:
loyalty number                          int64
year                                    int64
month                                   int64
flights booked                          int64
flights with companions                 int64
total flights                           int64
distance                                int64
points accumulated                    float64
points redeemed                         int64
dollar cost points redeemed             int64
country                                object
province                               object
city                                   object
postal code                            object
gender                                 object
education                              object
salary                                float64
marital status                         object
loyalty card                           object
clv                                   float64
enrollment type                        object
enrollment year                         int64
enrollment month                        int64
cancellation year                     float64
cancellation month                    float64
date                           datetime64[ns]
dtype: object

Salary después de corrección:
count    405624.000000
mean      79352.935177
std       30019.544556
min        9081.000000
25%       63899.000000
50%       79268.825953
75%       82940.000000
max      407228.000000
Name: salary, dtype: float64

Nulos restantes en Salary: 0

In [329]:
# Guardar datasets procesados (columnas en minúsculas)
df_flights.to_csv('customer_flight_activity_clean.csv', index=False)
df_loyalty.to_csv('customer_loyalty_history_clean.csv', index=False)
df.to_csv('df_merged_clean.csv', index=False)

print("✅ Guardados:")
print("- customer_flight_activity_clean.csv")
print("- customer_loyalty_history_clean.csv") 
print("- df_merged_clean.csv")

✅ Guardados:
- customer_flight_activity_clean.csv
- customer_loyalty_history_clean.csv
- df_merged_clean.csv

In [330]:
# En lugar de los originales, cargar los limpios
df_flights = pd.read_csv('customer_flight_activity_clean.csv')
df_loyalty = pd.read_csv('customer_loyalty_history_clean.csv')
df = pd.read_csv('df_merged_clean.csv')